stm32-hotspot/STM32WB-BLE-NFC-Reader/Projects/P-NUCLEO-WB55.Nucleo/Applications/MOTENV1/Core/Src/ndef_demo.c
        state = DEMO_ST_START_DISCOVERY;
        return true;
    }
    return false;
}

uint32_t cycle_count = 0;

/*!
 *****************************************************************************
 * \brief Demo Cycle
 *
 *  This function executes the demo state machine. 
 *  It must be called periodically
 *****************************************************************************
 */
void demoCycle( void )
{
    static rfalNfcDevice *nfcDevice;

    rfalNfcaSensRes       sensRes;
    rfalNfcaSelRes        selRes;
    
    rfalNfcbSensbRes      sensbRes;
    uint8_t               sensbResLen;
    
    uint8_t               devCnt = 0;
    rfalFeliCaPollRes     cardList[1];
    uint8_t               collisions = 0U;
    rfalNfcfSensfRes*     sensfRes;

    rfalNfcvInventoryRes  invRes;
    uint16_t              rcvdLen;
    
    rfalNfcWorker();                                    /* Run RFAL worker periodically */
    
    if( (ndefDemoFeature != NDEF_DEMO_READ) && (platformTimerIsExpired(timer)) )
    {
        platformLog("Timer expired, back to Read mode...\r\n");
        ndefDemoFeature = NDEF_DEMO_READ;
    }
    
    if( ndefDemoFeature != ndefDemoPrevFeature )
    {
        ndefDemoPrevFeature = ndefDemoFeature;
        platformLog("%s\r\n", ndefDemoFeatureDescription[ndefDemoFeature]);
    }
    
    if( ndefDemoFeature != NDEF_DEMO_READ )
    {
        if( platformTimerIsExpired(timerLed) )
        {
            timerLed = platformTimerCreate(NDEF_LED_BLINK_DURATION);
            ledOn = !ledOn;
        }
        if( ledOn )
        {
            ledsOn();
        }
        else
        {
            ledsOff();
        }
    }
    
//    checkUserButton();
    //[STM] - Commented out to avoid conflicts with B1_Pin (PC4) 
//    /*******************************************************************************/
//    /* Check if USER button is pressed */
//    if( platformGpioIsLow(PLATFORM_USER_BUTTON_PORT, PLATFORM_USER_BUTTON_PIN))
//    {
//        discParam.wakeupEnabled = !discParam.wakeupEnabled;    /* enable/disable wakeup */
//        state = DEMO_ST_START_DISCOVERY;                       /* restart loop          */
//
//        /* Debounce button */
//        while( platformGpioIsLow(PLATFORM_USER_BUTTON_PORT, PLATFORM_USER_BUTTON_PIN) );
//    }
    
    switch( state )
    {
        /*******************************************************************************/
        case DEMO_ST_START_DISCOVERY:
            ledsOff();
    
            rfalNfcDeactivate( false );
            rfalNfcDiscover( &discParam );

            state = DEMO_ST_DISCOVERY;
            break;

        /*******************************************************************************/
        case DEMO_ST_DISCOVERY:
            if( rfalNfcIsDevActivated( rfalNfcGetState() ) )
            {
                rfalNfcGetActiveDevice( &nfcDevice );
                
                ledsOff();

                ndefDemoPrevFeature = 0xFF; /* Force the display of the prompt */
                switch( nfcDevice->type )
                {
                    /*******************************************************************************/
                    case RFAL_NFC_LISTEN_TYPE_NFCA:
                    
                        platformLedOn(PLATFORM_LED_A_PORT, PLATFORM_LED_A_PIN);
                        switch( nfcDevice->dev.nfca.type )
                        {
                            case RFAL_NFCA_T1T:
                                platformLog("ISO14443A/Topaz (NFC-A T1T) TAG found. UID: %s\r\n", hex2Str( nfcDevice->nfcid, nfcDevice->nfcidLen ) );
                                rfalNfcaPollerSleep();
                                break;
                            
                            case RFAL_NFCA_T4T:
                                platformLog("NFCA Passive ISO-DEP device found. UID: %s\r\n", hex2Str( nfcDevice->nfcid, nfcDevice->nfcidLen ) );
                                
                                //[STM] - Per Bruno
                                if (platformTimerIsExpired(jtTimer))
                                {
                                  previous_nfcDevice.dev.nfca.nfcId1[0] = 0;
                                }                                
                                if(memcmp(previous_nfcDevice.dev.nfca.nfcId1, nfcDevice->dev.nfca.nfcId1, nfcDevice->nfcidLen) != 0)
                                {
                                  demoNdef(nfcDevice);                                  
                                }
                                
                                rfalIsoDepDeselect(); 
                                break;
                            
                            case RFAL_NFCA_T4T_NFCDEP:
                            case RFAL_NFCA_NFCDEP:
                                platformLog("NFCA Passive P2P device found. NFCID: %s\r\n", hex2Str( nfcDevice->nfcid, nfcDevice->nfcidLen ) );
                                demoP2P();
                                break;
                                
                            default:
                                platformLog("ISO14443A/NFC-A card found. UID: %s\r\n", hex2Str( nfcDevice->nfcid, nfcDevice->nfcidLen ) );
                                demoNdef(nfcDevice);
                                rfalNfcaPollerSleep();
                                break;
                        }
                     
                        /* Loop until tag is removed from the field */
                        platformLog("Operation completed\r\nTag can be removed from the field\r\n");
                        //previous_UID = nfcDevice->dev.nfca.nfcId1;
                        previous_nfcDevice = *nfcDevice;
                        jtTimer = platformTimerCreate(2000);
//                        while( rfalNfcaPollerCheckPresence(RFAL_14443A_SHORTFRAME_CMD_WUPA, &sensRes) == ERR_NONE )          //[STM] - Removed per Bruno
//                        {
//                            if( ((nfcDevice->dev.nfca.type == RFAL_NFCA_T1T) && (!rfalNfcaIsSensResT1T(&sensRes ))) ||
//                                ((nfcDevice->dev.nfca.type != RFAL_NFCA_T1T) && (rfalNfcaPollerSelect(nfcDevice->dev.nfca.nfcId1, nfcDevice->dev.nfca.nfcId1Len, &selRes) != ERR_NONE)) )
//                            {
//                                break;
//                            }
//                            rfalNfcaPollerSleep();
//                            platformDelay(130);
//                        }
                        break;
                    
